import React from "react";

interface MenuDepth4TabListProps {
  selectedDepth2: string;
  selectMenu: string;
}


const MenuDepth4TabList: React.FC<MenuDepth4TabListProps> = ( { selectedDepth2, selectMenu } ) =>{
  
  const menuData:any = {
    재무회계: {
      전표입력: {
        depth4: ['일반전표입력', '매입매출전표입력', '시산표입력', '전표출력', '업무용승용차운행기록부']
      },
      기타전입력: {
        depth4: ['빠른전표입력', '국세청전자(세금)계산서','엑셀자료일반전표전송','신용카드매입매출전표전송','기타매입매출전표전송','물류(수금,지급)일반전표전송','통장거래자동입력','국세청사업용(복지)신용카드','현금영수증자동분개','매입신용카드']
      },
      장부관리I: {
        depth4: ['거래처원장' , '계정과목원장', '부가세과세표준원장', '부가세면세원장', '부가세신고서', '신고서출력', '신고서전송', '전송내역조회', '전송내역출력']
      },
      장부관리II: {
        depth4: ['매입매출장', '매입매출전표', '전표조회', '전표출력', '전표전송', '전표전송내역조회', '전표전송내역출력']
      },
      결산관리: {
        depth4: ['결산자료입력', '결산자료조회', '결산자료출력', '결산자료전송', '결산자료전송내역조회', '결산자료전송내역출력']
      },
      고정자산및감가상가: {
        depth4: ['고정자산등록', '감가상각']
      },
      전기분재무제표: {
        depth4: ['전기분재무상태표', '전기분손익계산서', '전기분현금흐름표', '전기분자본변동표']
      },
      기초정보관리: {
        depth4: ['회사등록', '거래처등록', '계정과목등록', '부가세과세표준등록', '부가세면세등록', '부가세신고서등록', '부가세신고서등록']
      }
    },
    "자금/예산/현장등": {
      부가가치세: {
        depth4: ['부가가치세신고서', '부가가치세신고서전송', '신고서전송내역조회', '부가가치세내역출력']
      },
      법인세: {
        depth4: ['법인세신고서', '법인세신고서전송', '신고서전송내역조회', '법인세내역출력']
      },
      소득세: {
        depth4: ['소득세신고서', '소득세신고서전송', '신고서전송내역조회', '소득세내역출력']
      },
      부가세신고: {
        depth4: ['부가세신고서', '부가세신고서전송', '신고서전송내역조회', '부가세내역출력']
      }     
    },
    "데이터분석/관리": {
      인사관리: {
        depth4: ['부가가치세신고서', '부가가치세신고서전송', '신고서전송내역조회', '부가가치세내역출력']
      },
      급여관리: {
        depth4: ['법인세신고서', '법인세신고서전송', '신고서전송내역조회', '법인세내역출력']
      },
      "4대보험": {
        depth4: ['소득세신고서', '소득세신고서전송', '신고서전송내역조회', '소득세내역출력']
      }
    },
  }
 
  const depth4List = menuData[selectedDepth2]?.[selectMenu]?.depth4 || [];
  
  return (
    <ul className="mainDepth4_TabList">
      {depth4List.map((menu:string, index:any) => (
        <li key={index}>{menu}</li>
      ))}
    </ul>
  );
}

export default MenuDepth4TabList;